/**********************************************************************************************************************
* @file  GameSessionMaanger.cpp
*
* @brief GameSessionMaanger 클래스 cpp 파일
*
* @date  2025.03.03
**********************************************************************************************************************/


#include "pch.h"
#include "GameSessionMaanger.h"
#include "GameSession.h"


/// 게임 세션 관리자
GameSessionMaanger GSessionManager;


/**********************************************************************************************************************
* @brief 추가한다
**********************************************************************************************************************/
ExVoid GameSessionMaanger::Add( GameSessionPtr session )
{
    WRITE_LOCK;
    _sessionSet.insert( session );
}

/**********************************************************************************************************************
* @brief 제거한다
**********************************************************************************************************************/
ExVoid GameSessionMaanger::Remove( GameSessionPtr session )
{
    WRITE_LOCK;
    _sessionSet.erase( session );
}

/**********************************************************************************************************************
* @brief 브로드캐스트 한다
**********************************************************************************************************************/
ExVoid GameSessionMaanger::Broadcast( SendBufferPtr sendBuffer )
{
    WRITE_LOCK;
    for ( const GameSessionPtr& session : _sessionSet )
        session->Send( sendBuffer );
}
