/**********************************************************************************************************************
* @file  GameServer.cpp
*
* @brief 프로그램 실행 시작 파일
*
* @date  2025.02.15
**********************************************************************************************************************/


#include "pch.h"
#include "ThreadManager.h"
#include "SocketUtil.h"
#include "Listener.h"


/**********************************************************************************************************************
* @brief 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
**********************************************************************************************************************/
int main()
{
	Listener listener;
	listener.StartAccept( NetAddress( L"127.0.0.1", 7777 ) );

	for ( ExInt32 i = 0; i < 5; i++ )
	{
		GThreadManager->Launch( [ = ]()
		{
			while ( true )
			{
				GIocpCore.Dispatch();
			}
		} );
	}

	GThreadManager->Join();
}
