/**********************************************************************************************************************
* @file  IocpObject.h
*
* @brief IocpObject 클래스 h 파일
*
* @date  2025.02.23
**********************************************************************************************************************/


#pragma once


/**********************************************************************************************************************
* @class IocpObject
*
* @brief IocpObject 가상 클래스
**********************************************************************************************************************/
class IocpObject : public enable_shared_from_this< IocpObject >
{
public:
	/// 핸들러를 반환한다.
	virtual HANDLE GetHandle() abstract;

	/// 처리한다.
	virtual void Dispatch( class IocpEvent* iocpEvent, ExInt32 numOfBytes = 0 ) abstract;
};
