/**********************************************************************************************************************
* @file  IocpDisconnectEvent.h
*
* @brief IocpDisconnectEvent 클래스 h 파일
*
* @date  2025.03.02
**********************************************************************************************************************/


#pragma once


#include "IocpEvent.h"


/**********************************************************************************************************************
* @class IocpDisconnectEvent
*
* @brief IocpDisconnectEvent 처리 클래스
**********************************************************************************************************************/
class IocpDisconnectEvent : public IocpEvent
{
public:
    /// 생성자
    IocpDisconnectEvent();

    /// 소멸자
    ~IocpDisconnectEvent() = default;
};

