/**********************************************************************************************************************
* @file  RWSpinLock.h
*
* @brief RWSpinLock 클래스 h 파일
*
* @date  2025.02.16
**********************************************************************************************************************/


#pragma once


#include "Types.h"
#include "LockType.h"


/**********************************************************************************************************************
* @class Lock
*
* @brief RWSpinLock 클래스
**********************************************************************************************************************/
class RWSpinLock : public Noncopyable
{
private:
	/// 락 플래그
	ExAtomic< ExUInt32 > _lockFlag = EmptyMask;

	/// 쓰기 잠금 횟수
	ExUInt16 _writeCount = 0;

public:
	/// 쓰기 잠금
	void WriteLock();

	/// 쓰기 잠금 해제
	void WriteUnlock();

	/// 읽기 잠금
	void ReadLock();

	/// 읽기 잠금 해제
	void ReadUnlock();
};
